<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Service;

class ServiceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */

    public function run(): void
    {
        $services = [
            'فتح وريد',
            'اختبار تحسس',
            'تسريب سوائل وريدية',
            'تسريب سوائل وريدية مع الأدوات',
            'تسريب أدوية',
            'تسريب دم',
            'تسريب حديد',
            'حقن إبرة عضلية',
            'حقن إبرة تحت الجلد',
            'حقن إبرة (فيالة بودرة)',
            'حقن أنسولين',
            'إعطاء حقنة شرجية',
            'قياس ضغط',
            'قياس سكر',
            'قياس حرارة',
            'قياس أكسجة',
            'تركيب NGT',
            'فك NGT',
            'تركيب قثطرة بولية (كوندوم)',
            'تركيب قثطرة بولية (داخلية)',
            'فك قثطرة بولية',
            'تبديل قثطرة فوق العانة',
            'تبديل فغر معدة',
            'خياطة جروح',
            'فك قطب / غرزات جراحية',
            'تغيير ضماد الحروق',
            'تبديل ضماد بعد عمل جراحي',
            'تبديل ضماد سكري',
            'تغيير ضماد القرحة الاضجاعية',
            'تنضير القرحة الاضجاعية',
            'تنضير القدم السكري',
            'جلسة إرذاذ',
            'سحب مفرزات طفل',
            'سحب مفرزات كبار',
            'العناية بفغر القولون (تركيب أكياس كولوستومي)',
            'استخراج برادة من العين',
            'فك جبس',
            'سحب مفجر',
            'الحجامة',
            'إجراء الختان',
            'كافة الخدمات التمريضية الأخرى',
        ];

        foreach ($services as $service) {
            \App\Models\Service::firstOrCreate(
                ['service_name' => $service],
                ['service_type' => 'nurse']
            );
        }
    }

}
